export const getFlag = (code: string | undefined) => {
  if (!code) return '🏳️'
  const c = code.toUpperCase()
  const flags: Record<string, string> = {
    MEX: '🇲🇽', RSA: '🇿🇦', KOR: '🇰🇷', CZE: '🇨🇿',
    CAN: '🇨🇦', QAT: '🇶🇦', SUI: '🇨🇭', BIH: '🇧🇦',
    BRA: '🇧🇷', MAR: '🇲🇦', HAI: '🇭🇹', SCO: "🏴󠁧󠁢󠁳󠁣󠁴󠁿",
    USA: '🇺🇸', PAR: '🇵🇾', AUS: '🇦🇺', TUR: '🇹🇷',
    GER: '🇩🇪', CUR: '🇨🇼', CIV: '🇨🇮', ECU: '🇪🇨',
    NED: '🇳🇱', JPN: '🇯🇵', TUN: '🇹🇳', SWE: '🇸🇪',
    BEL: '🇧🇪', EGY: '🇪🇬', IRN: '🇮🇷', NZL: '🇳🇿',
    ESP: '🇪🇸', CPV: '🇨🇻', KSA: '🇸🇦', URU: '🇺🇾',
    FRA: '🇫🇷', IRQ: '🇮🇶', SEN: '🇸🇳', NOR: '🇳🇴',
    ARG: '🇦🇷', ALG: '🇩🇿', AUT: '🇦🇹', JOR: '🇯🇴',
    COD: '🇨🇩', POR: '🇵🇹', UZB: '🇺🇿', COL: '🇨🇴',
    ENG: '🏴󠁧󠁢󠁥󠁮󠁧󠁿', CRO: '🇭🇷', GHA: '🇬🇭', PAN: '🇵🇦',
  }
  return flags[c] || '🏳️'
}
